오랜만에 정신잡고 들어왔는데 2년전이다..
새로운 마음가짐으로 다시시작한다.

2024-01-09 알고리즘 스터디 복습 1일차 (기본적인 개념틀 잡기)

자료구조란?
데이터 값의 모임, 각 원소들이 논리적으로 정의된 규칙에 의해 나열되며 자료에 대한 처리를 효율적으로 처리할 수 있도록 자료를 구분하여 표현한 것.
메모리 공간을 효율적으로 사용하는데 필요한 것.
+ 실행 시간의 효율성도 따진다.

자료구조는 선형, 비선형으로 구분된다.
선형 구조에는 스택, 큐, 덱, 리스트가 있다.
비선형 구조에는 트리, 그래프가 있다.

큐 : FIFO(First In First Out)(선입선출)
데이터를 넣는 것을 enqueue, 빼는 것을 dequeue 라고 한다.
가장 먼저 들어온 데이터가 가장 먼저 나간다.
BFS에 활용된다.
(BFS란 Breadth-First Search의 약자로 너비 우선 탐색을 뜻한다. 깊게 탐색하기전 넓게 탐색함을 뜻한다.)

선형큐
선형큐란 일직선으로 된것으로 큐에서 많이 쓰이며 일반적인 큐 구조이다.
선형큐의 문제점으로는 배열 구현시 크기가 제한된다.
빈 공간을 사용하려면 모든 자료를 꺼내거나 자료를 한 칸씩 옮겨야 한다. 그렇게 되면 지연시간이 발생한다.
enqueue, dequeue 작업이 계속적으로 일어나면 큐가 비어있어도 데이터 추가가 불가능한 Overflow가 발생하게 된다.
이 문제점을 해결하기 위해 원형큐를 사용한다.

원형큐
1차원 배열 형태의 큐를 원형으로 구성하여 배열의 처음과 끝을 연결한 모양이다.
초기 공백상태에서는 원형 순환을 위해 front, rear 모두 0으로 설정한다.
데이터를 처음부터 넣는다고 가정하면 front는 0이고 rear는 계속 증가할 것이다.
배열의 마지막까지 도달했는데 배열의 맨 앞 데이터가 빠져서 빈공간이 생긴다면 rear는 다시 처음으로 돌아와 0으로 설정되며 그 위치에 데이터를 저장할 수 있게 된다.
장점으로는 데이터를 처리할 때 기존의 큐처럼 매번 한칸씩 당겨오지 않아도 공간이 허락하는 한 데이터를 빠르게 처리할 수 있다.

스택 : LIFO(Last In First Out)
자료를 넣는것을 push 빼는것을 pop이라고 한다.
물통이라고 생각하면 쉽다.
DFS에 활용된다.
(DFS란 깊이 우선 탐색을 뜻한다.)
지정한 메모리 보다 더 많은 스택 메모리를 사용하게 되면 스택오버플로우가 발생한다.

장점 : top(제일 최근에 넣은 자료, 데이터)을 통해 접근하기 때문에 데이터 접근, 삽입, 삭제가 빠르다
단점 : top위치 이외의 데이터에 접근할 수 없기 때문에 다른 데이터에 탐색이 불가능하다.

데크 : 양쪽 끝에서 원소의 삽입 삭제가 가능한 자료구조
그래서 보통 회원정보를 저장할때 사용된다.(주민등록번호같은 안바뀌는거 먼저 넣고 이름, 닉네임, 전화번호등 쉽게 바뀔 수 있는 데이터들은 나중에 넣는다.)




처음 배우는 거라 그런지 너무 간단하게 설명해 주는건지 어느정도로 설명해주는건지 감이 안온다.
솔직히 알려주는 사람이 잘 모르는거 같기도 하다..
따로 복습하면서 더 공부해야 할듯

